Revit 2024 API
RebarContainerItem.GetCenterlineCurves Method (Boolean, Boolean, Boolean, MultiplanarOption)
 A chain of curves representing the centerline of the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public IList<Curve> GetCenterlineCurves(
	bool adjustForSelfIntersection,
	bool suppressHooks,
	bool suppressBendRadius,
	MultiplanarOption multiplanarOption
)
Visual Basic
Public Function GetCenterlineCurves ( _
	adjustForSelfIntersection As Boolean, _
	suppressHooks As Boolean, _
	suppressBendRadius As Boolean, _
	multiplanarOption As MultiplanarOption _
) As IList(Of Curve)
Visual C++
public:
IList<Curve^>^ GetCenterlineCurves(
	bool adjustForSelfIntersection,
	bool suppressHooks,
	bool suppressBendRadius,
	MultiplanarOption multiplanarOption
)
Parameters
adjustForSelfIntersection
Type: System.Boolean
 If the curves overlap, as in a planar stirrup, this parameter controls whether they should be adjusted to avoid intersection (as in fine views), or kept in a single plane for simplicity (as in coarse views).
suppressHooks
Type: System.Boolean
 Identifies if the chain will include hooks curves.
suppressBendRadius
Type: System.Boolean
 Identifies if the connected chain will include unfilleted curves.
multiplanarOption
Type: Autodesk.Revit.DB.Structure.MultiplanarOption
 If the Rebar is a multi-planar shape, this parameter controls whether to generate only the curves in the primary plane (IncludeOnlyPlanarCurves), or to generate all curves, (IncludeAllMultiplanarCurves) including the out-of-plane connector segments as well as multi-planar copies of the primary plane curves. This argument is ignored for planar shapes.
Return Value
 The centerline curves or empty array if the curves cannot be computed because the parameters values are inconsistent with the constraints of the RebarShape definition.
Remarks
 If the Rebar is a set, meaning GetLayoutRule() does not return Single, this method returns the first rebar in the set, even if the first bar is suppressed by IncludeFirstBar being false.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
RebarContainerItem Class
GetCenterlineCurves Overload
Autodesk.Revit.DB.Structure Namespace